In [1]:
from utils.query_db import db_connection

### **ALIASES** (**`AS`** keyword)

PostgreSQL ALIASES can be used to create a temporary name for columns or tables.

* COLUMN ALIASES are used to make column headings in your result set easier to read.
* TABLE ALIASES are used to shorten your SQL to make it easier to read or when you are performing a self join (ie: listing the same table more than once in the FROM clause).

#### Syntax
The syntax to alias a column in PostgreSQL is:

`column_name [ AS ] alias_name`

OR

The syntax to alias a table in PostgreSQL is:

`table_name [ AS ] alias_name`

#### Parameters or Arguments
* **`column_name`** The original name of the column that you wish to alias.
* **`table_name`** The original name of the table that you wish to alias..
* **`AS`** Optional. Most programmers will specify the AS keyword when aliasing a column name, but not when aliasing a table name. Whether you specify the AS keyword or not has no impact on the alias in PostgreSQL. It is a personal choice in PostgreSQL, unlike other databases. (Our examples will use AS when aliasing a column name but omit AS when aliasing a table name.).
* **`alias_name`** The temporary name to assign to the column or table.

#### Note
* If the alias_name contains spaces, you must enclose the alias_name in quotes.
* It is acceptable to use spaces when you are aliasing a column name. However, it is not generally good practice to use spaces when you are aliasing a table name.
* The alias_name is only valid within the scope of the SQL statement.
#### Sources
[1] PostgreSQL Tutorial, *PostgreSQL: ALIASES*, Techonthenet.com, https://www.techonthenet.com/postgresql/alias.php (*Retrieved 2023-03-17*)

In [2]:
with db_connection() as conn:
    conn.fetch_all("""SELECT amount AS rental_price
                      FROM payment
                      LIMIT 5;""")

  rental_price
0         7.99
1         1.99
2         7.99
3         2.99
4         7.99

In [3]:
with db_connection() as conn:
    conn.fetch_all("""SELECT amount AS "rental price"
                      FROM payment
                      LIMIT 5;""")

  rental price
0         7.99
1         1.99
2         7.99
3         2.99
4         7.99

In [4]:
with db_connection() as conn:
    conn.fetch_all("""SELECT amount "rental price"
                      FROM payment
                      LIMIT 5;""")

  rental price
0         7.99
1         1.99
2         7.99
3         2.99
4         7.99

**Important**: The **`AS`** keyword gets executed at the very end of a query, meaning that we can not use the ALIAS inside a **`WHERE`** or **`HAVING`** statement.